Repository: JulioLoayzaM/CroissantBot
Catalog: docs/locale/*/LC_MESSAGES/getting_started/bot.po
Languages: es

source: Running the bot
es: Usar el bot

source: A guide on how to create and run the bot.
es: Una guía sobre como crear y usar el bot

source: Intro
es: Introducción

source: CroissantBot's main file is :py:mod:`bot.py`. This contains the code to run the base bot. This includes the ``exit``, ``help``, ``ping``, ``test`` and ``version`` commands.
es: El archivo principal de CroissantBot es :py:mod:`bot.py`. Contiene el código para correr el bot de base; esto incluye los comandos ``exit``, ``help``, ``ping``, ``test`` y ``version``.

source: For more commands, see :ref:`cogs/intro-cogs:intro to cogs`.
es: Para ver el resto de los comandos, ve :ref:`cogs/intro-cogs:intro to cogs`.

source: CroissantBot uses a file called ``.env`` to store its settings and credentials.
es: CroissantBot utiliza un archivo llamado ``.env`` para guardar su configuración y credenciales.

source: The **bot's default prefix** is ``!``.
es: El **prefijo por defecto** es ``!``.

source: Dependencies
es: Dependencias

source: This a list of all the packages used by the bot and its cogs. For the packages needed to run the base bot, see :ref:`getting_started/bot:packages` below.
es: Esta es una lista de todos los paquetes utilizados por el bot y sus cogs. Puedes encontrar la lista de paquetes esenciales :ref:`getting_started/bot:packages` más abajo.

source: I've tested the bot with Python 3.6.9 in Ubuntu 18.04 and Python 3.6.1 in Windows 10 using the following packages:
es: He probado el bot con Python 3.6.9 en Ubuntu 18.04 y con Python 3.6.1 en Windows 10 usando los paquetes siguientes:

source: Package
es: Paquete

source: Usage
es: Uso

source: Cog using it
es: Cog que lo usa

source: API wrapper for Discord with voice support
es: Wrapper del API de Discord con soporte de voz

source: The base bot
es: El bot de base

source: To store API keys and other secrets in a ``.env`` file
es: Para guardar llaves de API y otros secretos en un archivo ``.env``

source: To check the bot's current version
es: Para chequear la versión actual del bot

source: Asynchronous Python Reddit API Wrapper, to get memes from Reddit
es: 'Asynchronous Python Reddit API Wrapper', para conseguir memes de Reddit

source: To get music and livestream information from Youtube
es: Para conseguir música e información de livestreams de Youtube

source: Music, Youtube and Playlist
es: Music, Youtube y Playlist

source: To check for YouTube livestreams
es: Para chequear livestreams de Youtube

source: To connect to the PostgreSQL database
es: Para conectarse a la base de datos PostgreSQL

source: The :py:mod:`youtube-dl` package was used for the Music cog, but since it appears to no longer be maintained, using :py:mod:`yt-dlp` is recommended.
es: El paquete :py:mod:`youtube-dl` era utilizado por el cog Music, pero como no parece estar mantenido, se recomienda :py:mod:`yt-dlp`.

source: The :py:mod:`asyncpg` package.
es: El paquete :py:mod:`asyncpg`.

source: The Playlist cog, which also uses the :py:mod:`yt-dlp` package.
es: El cog Playlist, que también utiliza el paquete :py:mod:`yt-dlp`.

source: Requirements
es: Requisitos

source: Packages
es: Paquetes

source: The :py:mod:`discord.py[voice]` package:
es: El paquete :py:mod:`discord.py[voice]`:

source: The :py:mod:`python-dotenv` package:
es: El paquete :py:mod:`python-dotenv`:

source: The :py:mod:`packaging` package may be already included, but can be installed with :py:mod:`pip`:
es: Puede que el paquete :py:mod:`packaging` ya esté incluído, pero puedes instalarlo con :py:mod:`pip`:

source: env variables
es: Variables env

source: The file provided is actually called ``.env.example`` and not ``.env``. It contains all the variables the bot may use, alongside some comments on their use.
es: El archivo provisto se llama ``.env.example`` y no ``.env``. Contiene todas las variables que el bot puede usar, así como unos comentarios sobre su uso.

source: The base ``.env`` variables to set are:
es: Las variables ``.env`` esenciales son:

source: :envvar:`DISCORD_TOKEN`: the bot's token. Check the section :ref:`getting_started/bot:creating the bot` to know how to get it.
es: :envvar:`DISCORD_TOKEN`: el token del bot. Sigue la sección :ref:`getting_started/bot:creating the bot` para conseguirlo.

source: :envvar:`BOT_PREFIX`: the bot's prefix, which is the character used before a command to invoke the bot. It's set to ``!`` by default, but you can change it; just make sure it doesn't interfere with the prefix of other bots you use.
es: :envvar:`BOT_PREFIX`: el prefijo del bot, que es el símbolo que precede un comando para invocar al bot. Es ``!`` por defecto, pero puedes cambiarlo; solo asegúrate que no interfiera con el prefijo de otros bots que utilices.

source: The log files:
es: Los registros:

source: Create the ``logs`` directory.
es: Crea la carpeta ``logs``.

source: Create the four log files needed: ``info.log`` (stores INFO-level logs), ``debug.log`` (stores DEBUG-level logs), ``discord.log`` (stores DEBUG-level logs generated by :py:mod:`discord.py`) and ``streamlink.log`` (stores logs generated by :py:mod:`streamlink`).
es: Crea los cuatro registros necesarios: ``info.log`` (para registros de nivel INFO), ``debug.log`` (para registros de nivel DEBUG), ``discord.log`` (para registros de nivel DEBUG generados por :py:mod:`discord.py`) y ``streamlink.log`` (para registros generados por :py:mod:`streamlink`).

source: Set the corresponding variables to their paths, relative to ``bot.py``, like the ones already written.
es: Llena las variables correspondientes con la ruta relativa a ``bot.py``, como en los ejemplos provistos.

source: :envvar:`LOG_COUNT`: the logs files are emptied at midnight and their contents stored in an additional file (named ``something.log.202x-xx-xx``). This variable indicates how many files of each log should be stored at once. By default the bot saves a week's worth of logs.
es: :envvar:`LOG_COUNT`: los archivos de registro son vaciados a medianoche y su contenido es guardado en un otro archivo (llamado ``algo.log.202x-xx-xx``). Esta variable indica cuantos días de registro deben guardarse. Por defecto, el bot guarda una semana de registros.

source: ``streamlink.log`` is only needed when using the :doc:`./../cogs/youtube` cog, but it's better to create it now than wonder why the bot can't find the file.
es: ``streamlink.log`` solo se utiliza con el cog :doc:`./../cogs/youtube` pero recomiendo crearlo ahora para luego evitar preguntarse porque el bot no encuentra el archivo.

source: Creating the bot
es: Creando el bot

source: There are two parts to creating the bot: the code itself (which in this case is already provided) and creating an application and its corresponding bot in Discord.
es: Crear el bot consiste en dos partes: el código del bot (que en este caso ya está provisto) y crear una aplicación y su bot en Discord.

source: Discord's side
es: El lado de Discord

source: To create the bot on Discord's side of things and get the bot's token, I recommend following `this guide <https://realpython.com/how-to-make-a-discord-bot-python/#how-to-make-a-discord-bot-in-the-developer-portal>`_. Here's a quick rundown of the steps to follow:
es: Para crear el bot en el lado de Discord y conseguir el token del bot, recomiendo seguir `esta guía <https://realpython.com/how-to-make-a-discord-bot-python/#how-to-make-a-discord-bot-in-the-developer-portal>`_ (en inglés). Aquí va un resumen de los pasos a seguir:

source: If needed, create a Discord account and verify your email.
es: Si necesario, crea una cuenta de Discord y verifica tu mail.

source: Login to `Discord's developer portal <https://discord.com/developers/applications>`_.
es: Conéctate al `portal de desarrolladores <https://discord.com/developers/applications>`_.

source: Create a new application.
es: Crea una nueva aplicación.

source: In the Bot section (on the left), create a bot. You can change the default name.
es: En la sección Bot (a la izquierda), crea un bot. Puedes cambiar el nombre por defecto.

source: Grab the token.
es: Consigue el token.

source: Scroll down and enable the ``server members intent`` under Privileged Gateway intents.
es: Desplázate hacia abajo y activa ``server members intent`` bajo 'Privileged Gateway intents'.

source: Code side
es: El lado del código

source: Keep reading to learn how to actually install the source code and run the bot.
es: Sigue leyendo para aprender como instalar el código y usar el bot.

source: Adding it to a server
es: Añadirlo a un servidor

source: To add the bot to a server (a guild in the API's terminology) see `this part <https://realpython.com/how-to-make-a-discord-bot-python/#adding-a-bot-to-a-guild>`_ of the previous guide. Essentially:
es: Para añadir el bot a un servidor (un guild en la terminología del API), sigue `esta parte <https://realpython.com/how-to-make-a-discord-bot-python/#adding-a-bot-to-a-guild>`_ de la guía mencionada previamente. En breve:

source: In the `developer portal <https://discord.com/developers/applications>`_, go to the OAuth2 tab.
es: En el `portal de desarrolladores <https://discord.com/developers/applications>`_, ve a la pestaña OAuth2.

source: In the OAuth2 URL Generator, select *bot* in Scopes.
es: En el generador de URL OAuth2, selecciona *bot* en Scopes.

source: As for permissions, there are two options:
es: Para los permisos, tienes dos opciones:

source: For a private server, Administrator is the easier choice.
es: Para un servidor privado, Administrator es la opción más simple.

source: For a bigger or more public server, it's better to select only the permissions needed for the bot to run correctly.
es: Para un servidor más grande o público, es mejor utilizar únicamente los permisos que el bot necesita para funcionar correctamente.

source: For now, the permissions I'm using with the bot are:
es: Por ahora, los permisos que utiliza el bot son:

source: Permissions
es: Permisos

source: You can set the bot to public, allowing anyone who has the link you generated to invite the bot to their server, provided they have the necessary permissions (Manage server permission). Or you can leave the bot as private, which means only you can use the link to add the bot to any server in which you have the Manage server permission.
es: Puedes marcar el bot como público, permitiendo a cualquiera que tenga el link que generaste invitar al bot a su servidor. O puedes dejarlo como privado, lo cual significa que solo tú puedes usar el link para añadir el bot a cualquier servidor en el que tengas el permiso de administrar el servidor.

source: Installation and setup
es: Instalación y configuración

source: Now, time to install the source code and run the bot!
es: ¡Ahora es el momento de instalar y usar el bot!

source: If you have a GitHub account, `clone the repo <https://docs.github.com/en/github/creating-cloning-and-archiving-repositories/cloning-a-repository-from-github/cloning-a-repository>`__.
es: Si tienes una cuenta de GitHub, `clona el repositorio <https://docs.github.com/en/github/creating-cloning-and-archiving-repositories/cloning-a-repository-from-github/cloning-a-repository>`__ (guía en inglés).

source: If not, create one or download the code from the `releases page <https://github.com/JulioLoayzaM/CroissantBot/releases>`__ (preferably the latest one, since this guide is written for version 2.0.0).
es: Sino, crea una o descarga el código desde la `página de versiones <https://github.com/JulioLoayzaM/CroissantBot/releases>`__ (de preferencia la más reciente, dado que esta guía corresponde a la versión 2.0.0).

source: Cloning the repo is recommended in order to use Git to easily update the bot.
es: Se recomienda clonar el repositorio para poder utilizar Git para actualizar fácilemente el bot.

source: Install Python 3.6+: use your package manager or head over to `the download page <https://www.python.org/downloads/>`__.
es: Instala Python 3.6+: utiliza tu package manager o dirígete a `la página de descargas <https://www.python.org/downloads/>`__.

source: This should install :py:mod:`pip`, Python's package installer. If unsure, read :py:mod:`pip`'s `getting started <https://pip.pypa.io/en/stable/getting-started/>`__ to verify and install it if needed.
es: Esto debería instalar :py:mod:`pip`, el instalador de paquetes de Python. En caso de duda, sigue `la guía de inicio <https://pip.pypa.io/en/stable/getting-started/>`__ de :py:mod:`pip` para verificarlo e instalarlo si necesario.

source: Optional but recommended: create a `virtual environment <https://python.land/virtual-environments/virtualenv>`__ to avoid conflicts with the dependencies.
es: Opcional pero recomendado: crea un `virtual environment <https://python.land/virtual-environments/virtualenv>`__ para evitar conflictos entre dependencias.

source: To install all the package dependencies, use:
es: Para instalar todas las dependencias, utiliza:

source: If you want to only install the packages needed for the base bot, see :ref:`getting_started/bot:packages`.
es: Si sólo quieres instalar los paquetes necesarios para el bot de base, ve :ref:`getting_started/bot:packages`.

source: If you haven't already, create the bot on Discord's side and get its token with the :ref:`section above <getting_started/bot:discord's side>`.
es: Si no lo hiciste aún, crea el bot en el lado de Discord y consigue el token con :ref:`esta sección <getting_started/bot:discord's side>`.

source: Use the token to fill the :envvar:`DISCORD_TOKEN` variable in ``.env.example``. If you haven't already, set the other variables :ref:`mentionned above <getting_started/bot:env variables>`.
es: Usa el token para llenar la variable :envvar:`DISCORD_TOKEN` en ``.env.example``. Si no lo hiciste aún, llena las otras variables :ref:`mencionadas más arriba <getting_started/bot:env variables>`.

source: Rename ``.env.example`` to ``.env``.
es: Cambia el nombre de ``.env.example`` a ``.env``.

source: This step is important. Normally, not renaming the file means the bot won't be able to find it and will fail starting up. Even if it doesn't, you should still rename it since it may get overwritten when updating the bot with ``git pull``. That's why the ``.example`` extension was added.
es: Este paso es importante. Normalmente, el hecho de no cambiar el nombre significa que el bot no podrá encontrar el archivo y no podrá iniciarse. Aún si lograra iniciarse, deberías cambiar el nombre porque su contenido podría ser sobreescrito al actualizar el bot con ``git pull``. Es por eso que la extensión ``.example`` fue añadida.

source: Add the bot to a server: for instructions :ref:`see above <getting_started/bot:adding it to a server>`.
es: Añade el bot a un servidor: para instrucciones, ve :ref:`más arriba <getting_started/bot:adding it to a server>`.

source: Then, run :py:mod:`bot.py`:
es: Finalmente, ejecuta :py:mod:`bot.py`:

source: Using cogs
es: Usar los cogs

source: Cogs are like extensions to the bot, and contain most of its commands. To find out more about them and how to use them, see :doc:`./../cogs/intro-cogs`.
es: Los cogs son como extensiones del bot, y contienen la mayoría de sus comandos. Para aprender más sobre ellos y como usarlos, ve :doc:`./../cogs/intro-cogs`.
