Repository: JulioLoayzaM/CroissantBot
Catalog: docs/locale/*/LC_MESSAGES/getting_started/intro.po
Languages: es

source: Introduction
es: Introducción

source: CroissantBot is a Discord bot written in Python using the `discord.py rewrite <https://github.com/Rapptz/discord.py>`__.
es: CroissantBot es un bot para Discord, desarrollado en Python usando `discord.py <https://github.com/Rapptz/discord.py>`_.

source: While the bot itself is not openly available, `its code is <https://github.com/JulioLoayzaM/CroissantBot>`_. This project aims to be a template to ease the creation of a new bot, allowing anyone\* to clone the repo, fill in the blanks with this documentation, and run it on their machine.
es: Si bien el bot mismo no está disponible al público, su código si lo está. Este repositorio apunta a ser una plantilla para facilitar la creación de un bot, permitiendo a cualquiera\* clonarlo, llenar los espacios en blanco con la documentación y usarlo en su máquina.

source: \*some Python experience is recommended, but this guide should provide the necessary to run the bot.
es: \*se recomienda algo de experiencia con Python

source: Features
es: Características

source: For a list of all commands, check :ref:`getting_started/commands:commands`.
es: Para la lista de todos los comandos, ve :ref:`getting_started/commands:commands`.

source: Music player
es: Reproductor de música

source: Play music from YouTube in voice chat. Supports playback on different servers simultaneously, with a queue for each one.
es: Reproduce música de YouTube en canales de voz. Permite reproducir en varios servidos simultáneamente, con una cola para cada uno.

source: You can save your favourite songs in one playlist, with minimal setup. See :ref:`cogs/favourites:favourites`.
es: Guarda tus canciones favoritas en una lista de reproducción, con configuración mínima. Ve :ref:`cogs/favourites:favourites`.

source: Use a PostgreSQL database to store as many playlists as you want. See :ref:`cogs/playlist:playlist`.
es: Utiliza una base de datos con PostgreSQL para guardar cuantas listas de reproducción quieras. Ve :ref:`cogs/playlist:playlist`.

source: Get memes from Reddit. Keeps track of memes sent to each server to avoid duplicates.
es: Saca memes de Reddit. Mantiene un registro de los memes enviados a cada servidor para evitar duplicados.

source: Livestream status
es: Estado de transmisiones en vivo

source: Sometimes Twitch's notifications are unreliable, so the bot can notify users about new streams through DMs. It works with YouTube streams as well.
es: A veces las notificaciones de Twitch no son fiables, así que el bot puede notificar a usuarios de nuevas transmisiones por mensaje privado. También funciona con transmisiones de YouTube.

source: Logging
es: Registros

source: Outputs basic information and errors to ``stdout``. Debug information is logged to a file. It should allow to at least pinpoint which function has caused an error.
es: Transmite información básica y errores por ``stdout``. Información de depuración (debug) es grabada en un archivo. Debería permitir al menos encontrar que función causó un error.
